/** 
 * //1
 * যা একটি ফাইল থেকে অন্য ফাইলে কোড শেয়ার করতে ব্যবহৃত হয়।
 * export – একটি ফাইল থেকে ফাংশন, ভেরিয়েবল বা ক্লাস অন্য ফাইলে ব্যবহারের জন্য পাঠায়।
 * import – অন্য ফাইল থেকে export করা জিনিসগুলো এনে ব্যবহার করে।
*/


/**
 * //2
 * default export হলো ফাংশন বা ভেরিয়েবল যা একটি ফাইল থেকে ডিফল্টভাবে এক্সপোর্ট করা হয়।
 * default export করলে import করার সময় আলাদা নাম ব্যবহার করা যায়।
 */

/**
 * //3
 * কোড লেখা ও ব্যবহারে সহজতা এনে দেয়।
 * এক্সপোর্ট করা ফাংশনের নাম পরিবর্তন করে ইমপোর্ট করা যায়।
 * সাধারণত একটি ফাইলের প্রধান ফাংশন বা ক্লাস default export করা হয়।
 */

/**
 * //4
 * as ব্যবহার করে export বা import এর নাম পরিবর্তন করা যায়।
 */

/**
 * //5
 * Named Export ব্যবহার করে একাধিক ফাংশন বা ভেরিয়েবল এক্সপোর্ট করা যায়।
 */